Flynsky/Aeolus/STM32_ESC/Software/ESC-FIRMWARE-V1/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PIN_VV_Sense_C_Pin GPIO_PIN_0
#define PIN_VV_Sense_C_GPIO_Port GPIOA
#define PIN_VI_Sense_C_Pin GPIO_PIN_1
#define PIN_VI_Sense_C_GPIO_Port GPIOA
#define PIN_VV_Sense_B_Pin GPIO_PIN_2
#define PIN_VV_Sense_B_GPIO_Port GPIOA
#define PIN_VI_Sense_B_Pin GPIO_PIN_3
#define PIN_VI_Sense_B_GPIO_Port GPIOA
#define PIN_VV_Sense_A_Pin GPIO_PIN_4
#define PIN_VV_Sense_A_GPIO_Port GPIOA
#define PIN_VI_Sense_A_Pin GPIO_PIN_5
#define PIN_VI_Sense_A_GPIO_Port GPIOA
#define V_BAT_DIV_Pin GPIO_PIN_6
#define V_BAT_DIV_GPIO_Port GPIOA
#define PIN_LO_A_Pin GPIO_PIN_7
#define PIN_LO_A_GPIO_Port GPIOA
#define PIN_HI_A_Pin GPIO_PIN_8
#define PIN_HI_A_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
